CaseLabGreenatom/src/Enums/СтатусЗаказаПоставщика/СтатусЗаказаПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусЗаказаПоставщика</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>НаправленПоставщику</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
  <enumValues>
    <name>ЗавтраПоставка</name>
  </enumValues>
  <enumValues>
    <name>СегодняПоставка</name>
  </enumValues>
</mdclass:Enum>

CaseLabGreenatom/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаказаПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CaseLabGreenatom/src/CommonModules/АктуализацияСтатусовЗаказовСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура АктуализироватьСтатусы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Ссылка КАК Ссылка,
		|	ЗаказПоставщику.ДатаПоставки КАК ДатаПоставки,
		|	ЗаказПоставщику.Статус КАК Статус
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	(ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЗаказаПоставщика.НаправленПоставщику)
		|			ИЛИ ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЗаказаПоставщика.Просрочен)
		|			ИЛИ ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЗаказаПоставщика.ЗавтраПоставка)
		|			ИЛИ ЗаказПоставщику.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЗаказаПоставщика.СегодняПоставка))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Статусы:
	НаправленПоставщику = Перечисления.СтатусЗаказаПоставщика.НаправленПоставщику;
	Просрочен = Перечисления.СтатусЗаказаПоставщика.Просрочен;
	ЗавтраПоставка = Перечисления.СтатусЗаказаПоставщика.ЗавтраПоставка;
	СегодняПоставка = Перечисления.СтатусЗаказаПоставщика.СегодняПоставка;
	
	//Даты:
	Сегодня = НачалоДня(ТекущаяДата());
	Завтра = Сегодня + 86400;
			
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ДатаПоставки = Сегодня Тогда
			
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.Статус = СегодняПоставка;
			Документ.Записать();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 сегодня поставка!", ВыборкаДетальныеЗаписи.Ссылка);
			Сообщение.КлючДанных = ВыборкаДетальныеЗаписи.Ссылка;
			Сообщение.Сообщить();
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ДатаПоставки = Завтра Тогда 
			
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.Статус = ЗавтраПоставка;
			Документ.Записать();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 завтра поставка!", ВыборкаДетальныеЗаписи.Ссылка);
			Сообщение.КлючДанных = ВыборкаДетальныеЗаписи.Ссылка;
			Сообщение.Сообщить();
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ДатаПоставки < Сегодня Тогда
			
			Документ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			Документ.Статус = Просрочен;
			Документ.Записать();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("%1 просрочен!", ВыборкаДетальныеЗаписи.Ссылка);
			Сообщение.КлючДанных = ВыборкаДетальныеЗаписи.Ссылка;
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
